model {
  ssd {
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        activation: RELU_6
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
          }
        }
        batch_norm {
          train: true
          scale: true
          center: true
          decay: 0.9997
          epsilon: 0.001
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {}
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
            }
          }
          batch_norm {
            train: true
            scale: true
            center: true
            decay: 0.9997
            epsilon: 0.001
          }
        }
      }
    }
    loss {
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.25
        }
      }
      localization_loss {
        weighted_smooth_l1 {}
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config {
  batch_size: 8
  num_steps: 10000
  fine_tune_checkpoint: "C:/Users/parad/Downloads/ssd_mobilenet_v2_coco_2018_03_29/ssd_mobilenet_v2_coco_2018_03_29/model.ckpt"
  fine_tune_checkpoint_type: "detection"
  use_bfloat16: false
  data_augmentation_options {
    random_horizontal_flip {}
  }
}

train_input_reader {
  label_map_path: "C:/Users/parad/Downloads/webar-measurement-tool/models/dataset/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "C:/Users/parad/Downloads/webar-measurement-tool/dataset/train.record"
  }
}

eval_config {
  num_examples: 100
  max_evals: 10
}

eval_input_reader {
  label_map_path: "C:/Users/parad/Downloads/webar-measurement-tool/models/dataset/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "C:/Users/parad/Downloads/webar-measurement-tool/dataset/val.record"
  }
}
